Catalogs/упПравилаРаспределенияРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упПравилаРаспределенияРасходов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРаспределенияРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упПоказателиРаспределенияРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упСпособыРаспределенияРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСпособыРаспределенияРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноПараметру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УказатьФормулуРаспределения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упПравилаРаспределенияРасходов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СпособРаспределения = Перечисления.упСпособыРаспределенияРасходов.ПропорциональноПараметру Тогда 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Формула");
	ИначеЕсли СпособРаспределения = Перечисления.упСпособыРаспределенияРасходов.УказатьФормулуРаспределения Тогда 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Параметр");
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
